Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisPartSpanningProperties Property
 The analysis part spanning properties.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartSpanningProperties AnalysisPartSpanningProperties { get; set; }
Public Property AnalysisPartSpanningProperties As AnalysisPartSpanningProperties
	Get
	Set
Property Value
Type: AnalysisPartSpanningProperties
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace